_drafts/DailyReports/2017/4/4-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-10 Mon 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9187b96">1. <div style="color:#369">今日计划</div></a></li>
<li><a href="#orgd64ab55">2. <div style="color:#369">今日收获</div></a>
<ul>
<li><a href="#orgbd170d4">2.1. 盲源分离</a>
<ul>
<li><a href="#org998b079">2.1.1. 盲源分离的数学模型</a></li>
<li><a href="#org0c951b2">2.1.2. 问题的基本假设</a></li>
<li><a href="#orgf70c6f6">2.1.3. 自然梯度解法</a></li>
</ul>
</li>
<li><a href="#org50bc83e">2.2. <div style="color:#369"> 引用</div></a></li>
</ul>
</li>
<li><a href="#org7f0564e">3.  <div style="color:#369">todo</div></a></li>
<li><a href="#org83f6ff2">4.  <div style="color:#369">明日计划</div></a></li>
</ul>
</div>
</div>
<div id="outline-container-org9187b96" class="outline-2">
<h2 id="org9187b96"><span class="section-number-2">1</span> <div style="color:#369">今日计划</div></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>看盲源分离和神经网络方面的知识,以及查找其他代替方法</li>
<li>15号将程序写出来以及论文弄好(还有五天)</li>
<li>完成论文的第一章,图片基础知识的介绍</li>
<li>有道口语一课（切记）</li>
</ul>
</div>
</div>



<div id="outline-container-orgd64ab55" class="outline-2">
<h2 id="orgd64ab55"><span class="section-number-2">2</span> <div style="color:#369">今日收获</div></h2>
<div class="outline-text-2" id="text-2">
<p>
``
</p>
</div>

<div id="outline-container-orgbd170d4" class="outline-3">
<h3 id="orgbd170d4"><span class="section-number-3">2.1</span> 盲源分离</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org998b079" class="outline-4">
<h4 id="org998b079"><span class="section-number-4">2.1.1</span> 盲源分离的数学模型</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
 &ensp;&ensp; 盲源分离是通信领域中的一个概念，它是一种能从来自多个传感器输出的混合信号，在混合信号之间并不线性相关，原始信号未知，信号混合方法也未知的情况下，分析出没有观测的原始信号。
</p>

<p>
 &ensp;&ensp;  假设具有 \(m\) 个独立的信号源 \(s_1(t),...,s_m(t)\) 和 \(n\) 个独立的观察量 \(x_1(t),...,x_n(t)\) ,观察量和信号源的关系如下:
</p>

<p>
\(x(t) = As(t)\)
</p>

<p>
其中 \(x(t) = [x_1(t),....,x_n(t)]^T\) ,
</p>

<p>
\(s(t) = [s_1(t),...,s_m(t)]^T\), \(A\) 是一个 \(nxm\) 的系数矩阵，原问题变成了已知 \(x(t)\) 和 \(s(t)\) 的独立性，求对 \(s(t)\) 的估计问题。假定有如下公式
</p>

<p>
\(y(t) = Wx(t)\)
</p>

<p>
其中 \(y(t)\) 是对 \(s(t)\) 的估计, \(W\) 是一个 \(mxn\) 的系数矩阵， 问题变成了如何有效的对矩阵 \(W\) 做出估计。
</p>
</div>
</div>


<div id="outline-container-org0c951b2" class="outline-4">
<h4 id="org0c951b2"><span class="section-number-4">2.1.2</span> 问题的基本假设</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
&ensp;&ensp; 各源信号 \(s_i(t)\) 均为零均值信号， 实随机变量，信号之间统计独立，如果源信号 \(s_i(t)\) 的概率面密度 \(p_i(s_i)\), 则 \(s(t)\) 的概率密度
为: \(p(s) = \prod_{i=1}^np_i(s_i))\)
</p>

<p>
&ensp;&ensp; 源信号数目 \(m\) 小于等于观察信号数目 \(n\), 即 \(m \leq n\) ,混合矩阵 \(A\) 是一个 \(n \times m\) 的矩阵。
假定 \(A\) 满秩。
</p>

<p>
&ensp;&ensp;  源信号中只允许有一个高斯分布，当多于一个高斯分布时，源信号变得不可分。
</p>
</div>
</div>


<div id="outline-container-orgf70c6f6" class="outline-4">
<h4 id="orgf70c6f6"><span class="section-number-4">2.1.3</span> 自然梯度解法</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
&ensp;&ensp;自然梯度法的计算公式为:
</p>

<p>
\(W(n+1) = W(n) + \eta(n)[I - \phi(y(n))y^T(n)]W(n)\)
</p>

<p>
其中 \(W\) 为我们需要估计的矩阵，\(\eta(n)\) 为步长, \(\phi(y)\) 是一个非线性变换，比如 \(\eta(y)=\eta(y^3)\)
实际计算时 \(y\) 为一个\(m \times k\) 的矩阵, \(m\) 为原始信号个数，\(k\) 为采样点个数。
</p>
</div>
</div>
</div>

<div id="outline-container-org50bc83e" class="outline-3">
<h3 id="org50bc83e"><span class="section-number-3">2.2</span> <div style="color:#369"> 引用</div></h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://zh.wikipedia.org/wiki/%E7%9B%B2%E4%BF%A1%E5%8F%B7%E5%88%86%E7%A6%BB">盲信号分离</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org7f0564e" class="outline-2">
<h2 id="org7f0564e"><span class="section-number-2">3</span>  <div style="color:#369">todo</div></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>详细了解cpp中的function-&gt;return type的用法</li>
<li>写一个管理markdown的博客vim插件(参考vim的vimwiki插件)</li>
<li>了解C++中的异常的使用</li>
<li>在emacs或者vim中实现一个小的智能程序</li>
<li>写一个类似Mac中的高亮当前鼠标位置的效果(Linux下)</li>
<li>在vim移植emacs的org-mode(针对markdown)</li>
<li>命令行的qq聊天(vim-plugin,emacs-plugin)</li>
<li>探究真正意义上的人工智能</li>
<li>学习黑客的思维</li>
<li>写个备份Gentoo Linux的脚本(Live版本,iso格式)</li>
<li>写个像Grammerly的功能的软件</li>
<li>写方面绑定手机的各种账号更换</li>
<li>看王垠的40行代码</li>
<li>学习scheme语言</li>
<li>详细看《Chapter 13. Copy contral》</li>
<li>详细看《 Chapter 12. Dynamic Memory》</li>
<li>详细看《13.1.4（p. 504）》</li>
<li>了解C++里面的lamda表达式</li>
<li>C++的线程相关操作</li>
<li>看825页的dynamic<sub>cast</sub>(看完虚函数再看)</li>
<li>《 CPP prime 》 看到Circumventing the Virtual Mechanism</li>
</ul>
</div>
</div>


<div id="outline-container-org83f6ff2" class="outline-2">
<h2 id="org83f6ff2"><span class="section-number-2">4</span>  <div style="color:#369">明日计划</div></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-10 Mon 22:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
